// Автоматичне приховування банера з підказкою Контекст: На сторінці після
//     завантаження з’являється підказка для користувача. Через кілька секунд її
//     потрібно автоматично прибрати. Базовий HTML:

import { refs } from './refs';

//     <section class="task hint-task">
//       <aside class="hint-banner">
//         <p class="hint-text">
//           Не забудьте перевірити введені дані перед надсиланням.
//         </p>
//       </aside>
//     </section>

//     Розширене ТЗ: · Після завантаження сторінки потрібно запустити setTimeout на
//     3000 мс. · Через 3000 мс елемент .hint-banner потрібно приховати. · id
//     таймера потрібно зберегти в окремій змінній. · До завершення таймера банер
//     має залишатися видимим. · Логіка повинна працювати без додаткових дій
//     користувача

let timerID = setTimeout(() => {
  refs.banner.classList.add('hidden');
}, 1000);
